simplewebservice-callbackHandler-axis2/build/SimpleWebService.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:axis2="http://service.simplewebservice/" xmlns:ns1="http://org.apache.axis2/xsd" xmlns:ns="http://service.simplewebservice/xsd" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" targetNamespace="http://service.simplewebservice/">
    <wsdl:types>
        <xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://service.simplewebservice/xsd">
            <xs:element name="getName">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="name" nillable="true" type="xs:string"/>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="getNameResponse">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="return" nillable="true" type="xs:string"/>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
        </xs:schema>
    </wsdl:types>
    <wsdl:message name="getNameRequest">
        <wsdl:part name="parameters" element="ns:getName"/>
    </wsdl:message>
    <wsdl:message name="getNameResponse">
        <wsdl:part name="parameters" element="ns:getNameResponse"/>
    </wsdl:message>
    <wsdl:portType name="SimpleWebServicePortType">
        <wsdl:operation name="getName">
            <wsdl:input message="axis2:getNameRequest" wsaw:Action="urn:getName"/>
            <wsdl:output message="axis2:getNameResponse" wsaw:Action="urn:getNameResponse"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="SimpleWebServiceSoap11Binding" type="axis2:SimpleWebServicePortType">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <wsdl:operation name="getName">
            <soap:operation soapAction="urn:getName" style="document"/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:binding name="SimpleWebServiceSoap12Binding" type="axis2:SimpleWebServicePortType">
        <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <wsdl:operation name="getName">
            <soap12:operation soapAction="urn:getName" style="document"/>
            <wsdl:input>
                <soap12:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap12:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:binding name="SimpleWebServiceHttpBinding" type="axis2:SimpleWebServicePortType">
        <http:binding verb="POST"/>
        <wsdl:operation name="getName">
            <http:operation location="SimpleWebService/getName"/>
            <wsdl:input>
                <mime:content type="text/xml" part="getName"/>
            </wsdl:input>
            <wsdl:output>
                <mime:content type="text/xml" part="getName"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="SimpleWebService">
        <wsdl:port name="SimpleWebServiceHttpSoap11Endpoint" binding="axis2:SimpleWebServiceSoap11Binding">
            <soap:address location="http://localhost:8080/axis2/services/SimpleWebService"/>
        </wsdl:port>
        <wsdl:port name="SimpleWebServiceHttpSoap12Endpoint" binding="axis2:SimpleWebServiceSoap12Binding">
            <soap12:address location="http://localhost:8080/axis2/services/SimpleWebService"/>
        </wsdl:port>
        <wsdl:port name="SimpleWebServiceHttpEndpoint" binding="axis2:SimpleWebServiceHttpBinding">
            <http:address location="http://localhost:8080/axis2/services/SimpleWebService"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>
